from pymongo import MongoClient

# MongoDB连接信息
mongo_uri = "mongodb://d_eagle3_guangzhou_llt_meas:mongo_Dfdb19c@192.168.0.89:27017/d_eagle3_guangzhou_llt_meas"  # 替换为你的MongoDB连接字符串
db_name = "d_eagle3_guangzhou_llt_meas"  # 数据库名称
collection_name = "TEMP_GEAR_INFO"  # 集合名称

# 创建MongoDB客户端
client = MongoClient(mongo_uri)
db = client[db_name]
collection = db[collection_name]

# 只提供distran_name的数据列表
names_to_insert = [
    "陈妃营三专用台变",
"东平移动专用台变",
"曹南寿专用台变",
"陈兴专用台变",
"李荣生",
"吴琼专用台变",
"陈国恩专用台变",
"东平联通专用台变",
"陈珠明专用台变",
"陈彪专用台变",
"调风队8号专用台变",
"周勇专用台变",
"伍湖海专变",
"曹武东专用台变",
"吴学强专用台变",
"陈妃营二专用台变",
"曹耐专用台变",
"伍祥和专用台变",
"卜昌排灌十专用台变",
"卜昌排灌八专用台变",
"卜昌排灌九专用台变",
"卜昌排灌七专用台变",
"卜昌排灌六专用台变",
"卜昌排灌五专用台变",
"陈妃营专用台变",
"课堂耕地二专用台变",
"课堂耕地（一）专用台变",
"卜昌排灌四专用台变",
"陈腾飞专用台变",
"陈丁培专用台变",
"卜昌排灌十二专用台变",
"蔡权一专用台变",
"蔡权二专用台变",
"卜昌排灌一专用台变",
"李王森",
"陈锡专用台变",
"南边园移动专用台变",
"何来荣专用台变",
"中国移动卜昌专用台变",
"10kV陈腾飞二专用台变",
"李海仁专用台变",
"水库场补充耕地专变",
"曹日星专变",
"卜昌排灌二专用台变",
"东坡北村电灌溉站专用台变",
"李海仁#02专用台变",
"东平村专用台变",
"课堂村民委员会（一）专变",
"课堂村民委员会（二）专变",
"课堂村坡地（四）专用台变",
"雷州市调风镇课堂村民委员会（三）专变",
"蔡安荣专变",
"林产#1专变",
"林产#2专变",
"蔡权专变",
"黄进专变",
"企树基站专用台变",
"土央村专变",
"横山基站专用台变",
"李日保专用台变",
"仕礼混凝土专变",
"陈丁培虾塘专变",
"课堂村2020年高标#1专变",
"课堂村2020高标#2专变",
"卜昌村2020年高标#13专变",
"曹康军专用台变",
"冼马良专变",
"课堂村牧原农牧#3专变",
"课堂村牧原农牧#4专变",
"课堂村牧原农牧#5专变",
"课堂村牧原农牧#6专变",
"课堂村牧原农牧#1专变",
"吴同乐专变",
"课堂村牧原农牧#7专变",
"刘三溪专变",
"陈才盛专变",
"丁权专变",
"丰收调风队专变",
"堵海管理所专变",
"课堂村牧原农牧#8专用箱变专用变压器",
"课堂村牧原农牧#9专用箱变专用变压器",
"课堂村牧原农牧#10专用箱变专用变压器",
"陈文专用台变",
"吴志忠专用台变",
"伍忠武专用台变",
"苏华贵二专用台变",
"蔡小龙专用台变",
"陈拾专用台变",
"曹章葵专用台变",
"曹三头专用台变",
"陈谦专用台变",
"陈智专用台变",
"郑景生专用台变",
"曹忠专用台变",
"曹善专用台变",
"曹易专用台变",
"陈玉胜专用台变",
"曹志良专用台变",
"曹荣专用台变",
"吴胜杰专用台变",
"宋乃尚专用台变",
"陈仕成专用台变",
"蔡勇专用台变",
"曹妃云专变",
"黄广林专用台变",
"黄广明专用台变",
"曹坎黄专用台变",
"黄满专用台变",
"文佑专用台变",
"曹红专变",
"曹学仁专用台变"
]

# 构建要插入的文档列表
data_to_insert = [{"disttran_name": name} for name in names_to_insert]

# 插入数据
result = collection.insert_many(data_to_insert)

# 打印插入结果
print(f"Inserted {len(result.inserted_ids)} documents.")

# 关闭MongoDB连接
client.close()